//
//  XDReachability.m
//  AFN封装实时更新网络状态
//
//  Created by 窦心东 on 15/11/8.
//  Copyright © 2015年 XD. All rights reserved.
/**********************************************************************************
//  网络时时检测，做出动作
//                            _ooOoo_
//                           o8888888o
//                           88" . "88
//                           (| -_- |)
//                            O\ = /O
//                        ____/`---'\____
//                      .   ' \\| |// `.
//                       / \\||| : |||// \
//                     / _||||| -:- |||||- \
//                       | | \\\ - /// | |
//                     | \_| ''\---/'' | |
//                      \ .-\__ `-` ___/-. /
//                   ___`. .' /--.--\ `. . __
//                ."" '< `.___\_<|>_/___.' >'"".
//               | | : `- \`.;`\ _ /`;.`/ - ` : | |
//                 \ \ `-. \_ __\ /__ _/ .-` / /
//         ======`-.____`-.___\_____/___.-`____.-'======
//                            `=---='
//
//         .............................................
//                  佛祖镇楼                  BUG辟易
//          佛曰:
//                  写字楼里写字间，写字间里程序员；
//                  程序人员写程序，又拿程序换酒钱。
//                  酒醒只在网上坐，酒醉还来网下眠；
//                  酒醉酒醒日复日，网上网下年复年。
//                  但愿老死电脑间，不愿鞠躬老板前；
//                  奔驰宝马贵者趣，公交自行程序员。
//                  别人笑我忒疯癫，我笑自己命太贱；
//                  不见满街漂亮妹，哪个归得程序员？
**********************************************************************************/

#import "XDReachability.h"

@implementation XDReachability

+ (void)XDwithSuccessBlock:(successBlock)success
{
    [[self sharedManager]startMonitoring];
    
    [[self sharedManager]setReachabilityStatusChangeBlock:^(AFNetworkReachabilityStatus status) {
        
        if (status == 0) {
            success(@"无连接");
        }else if (status == 1){
            success(@"3G/4G网络");
        }else if (status == 2){
            success(@"wifi状态下");
        }else if (status == -1){
            success(@"未知网络状态");
        }
    }];
}

@end
